using MyBlog.Models;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace MyBlog.Entityes
{
    public class SeedBlogText
    {
        public static void SeedBlogData(DBContext context)
        {
            if (!context.Blog.Any())
            {
                context.Blog.AddRange(
                new BlogModel
                {
                    author = "BBC",
                    title = "Як знайти психолога, якщо на нього немає грошей. Блог мами особливої дитини ",
                    preview = "Часто мама особливої дитини - це загнана в кут складною життєвою" +
                    " ситуацією людина. " +
                    " Не потрібно із захопленням говорити такій мамі: Ах,яка ви сильна. Вона не" +
                    " сильна, вона навчилася приховувати свій біль.",
                    fullPost = "Чому не потрібно боятися піти до психолога"+
                    "Цій мамі потрібна допомога - перш за все,"+
                    "психологічна.Адже самозвинувачення та боротьба з собою виснажує."+
                    "Переможців у такій боротьбі не буває.Якщо постійно пристосуватися до труднощів й терпіти,"+
                    "стає гірше.Після безкінечних спроб змиритися,"+
                    "можна завити від безвиході."+
                    "Психолог може допомогти відчути свою силу й зрозуміти,"+
                    "що важливо пам'ятати і знати про себе. Адже особливі діти - не вирок, а історія, яка може скластися по-іншому."+
                    "Мене часто переслідували роздратування,"+
                    " пригніченість, а інколи й приреченість, адже я, насамперед,"+
                    "жива людина.Та я говорила: Сама впораюся.,",
                    img = "/images/mother.jpg"
                },
                 new BlogModel
                 {
                     author = "BBC",
                     title = "Як це в Британії. Транспорт: чи можливе життя без маршруток ",
                     preview = "У Лондоні немає маршруток і не потрібно передавати за проїзд. А година пік відрізняється лише тим, що в тисняві частіше лунають ввічливі вибачення і діалоги: 'Я вас штовхнув ? !I'm so sorry!' 'Sorry, це не ваша провина, а моя'. Загалом же, їздити британською столицею зручно - і дорого.",
                     fullPost = "Чому не потрібно боятися піти до психолога" +
                    "Цій мамі потрібна допомога - перш за все," +
                    "психологічна.Адже самозвинувачення та боротьба з собою виснажує." +
                    "Переможців у такій боротьбі не буває.Якщо постійно пристосуватися до труднощів й терпіти," +
                    "стає гірше.Після безкінечних спроб змиритися," +
                    "можна завити від безвиході." +
                    "Психолог може допомогти відчути свою силу й зрозуміти," +
                    "що важливо пам'ятати і знати про себе. Адже особливі діти - не вирок, а історія, яка може скластися по-іншому." +
                    "Мене часто переслідували роздратування," +
                    " пригніченість, а інколи й приреченість, адже я, насамперед," +
                    "жива людина.Та я говорила: Сама впораюся.,",
                     img = "/images/britan.jpg"
                 },
                  new BlogModel
                  {
                      author = "BBC",
                      title = "“Темний туризм”: подорожі, про які не заведено говорити ",
                      preview = "Після нещодавнього серіалу 'Чорнобиль' популярність турів у це місце екологічної катастрофи злетіла до небес. Але ще до серіалу Чорнобиль охрестили 'перлиною українського туризму'.",
                      fullPost = "Чому не потрібно боятися піти до психолога" +
                    "Цій мамі потрібна допомога - перш за все," +
                    "психологічна.Адже самозвинувачення та боротьба з собою виснажує." +
                    "Переможців у такій боротьбі не буває.Якщо постійно пристосуватися до труднощів й терпіти," +
                    "стає гірше.Після безкінечних спроб змиритися," +
                    "можна завити від безвиході." +
                    "Психолог може допомогти відчути свою силу й зрозуміти," +
                    "що важливо пам'ятати і знати про себе. Адже особливі діти - не вирок, а історія, яка може скластися по-іншому." +
                    "Мене часто переслідували роздратування," +
                    " пригніченість, а інколи й приреченість, адже я, насамперед," +
                    "жива людина.Та я говорила: Сама впораюся.,",
                      img = "/images/turizm.jpg"
                  },
                   new BlogModel
                   {
                       author = "BBC",
                       title = "Як жартують в ЛНР. Блог з Луганська ",
                       preview = "Розмірковуючи про те, як змінилася антологія гумору за останні п'ять років, перше, що спадає на думку, жартувати стали набагато менше.",
                       fullPost = "Чому не потрібно боятися піти до психолога" +
                    "Цій мамі потрібна допомога - перш за все," +
                    "психологічна.Адже самозвинувачення та боротьба з собою виснажує." +
                    "Переможців у такій боротьбі не буває.Якщо постійно пристосуватися до труднощів й терпіти," +
                    "стає гірше.Після безкінечних спроб змиритися," +
                    "можна завити від безвиході." +
                    "Психолог може допомогти відчути свою силу й зрозуміти," +
                    "що важливо пам'ятати і знати про себе. Адже особливі діти - не вирок, а історія, яка може скластися по-іншому." +
                    "Мене часто переслідували роздратування," +
                    " пригніченість, а інколи й приреченість, адже я, насамперед," +
                    "жива людина.Та я говорила: Сама впораюся.,",
                       img = "/images/maslo.jpg"
                   },
                new BlogModel
                {
                    author = "BBC",
                    title = "Як уявляли 2020 рік у кіно. Безлюдна Україна, Венера і морське дно. ",
                    preview = "Автори фантастичних фільмів запланували на 2020 рік низку визначних і вирішальних подій. Освоєння космосу, прорив у робототехніці і, звичайно, апокаліпсис.",
                    fullPost = "Чому не потрібно боятися піти до психолога" +
                    "Цій мамі потрібна допомога - перш за все," +
                    "психологічна.Адже самозвинувачення та боротьба з собою виснажує." +
                    "Переможців у такій боротьбі не буває.Якщо постійно пристосуватися до труднощів й терпіти," +
                    "стає гірше.Після безкінечних спроб змиритися," +
                    "можна завити від безвиході." +
                    "Психолог може допомогти відчути свою силу й зрозуміти," +
                    "що важливо пам'ятати і знати про себе. Адже особливі діти - не вирок, а історія, яка може скластися по-іншому." +
                    "Мене часто переслідували роздратування," +
                    " пригніченість, а інколи й приреченість, адже я, насамперед," +
                    "жива людина.Та я говорила: Сама впораюся.,",
                    img = "/images/mars.jpg"
                });
            }
            context.SaveChanges();
        }
    }
}
